uhnp/src/Catalogs/ПараметрыОбменаНСИ/ПараметрыОбменаНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыОбменаНСИ</name>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаМетаданных</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораИБ</name>
    <type>
      <types>EnumRef.СпособыВыбораИБДляОбменаНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеОбмена</name>
    <type>
      <types>EnumRef.ВыгрузкаЗагрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗапуска</name>
    <type>
      <types>EnumRef.СпособыЗапускаОбменаНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОтбора</name>
    <type>
      <types>CatalogRef.СохраненныеНастройкиОтборов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоИзмененные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресацияОбменаНСИ</name>
    <attributes>
      <name>АдресОбмена</name>
      <type>
        <types>CatalogRef.ТипыБазДанных</types>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>CatalogRef.СохраненныеНастройкиОтборов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/СпособыВыбораИБДляОбменаНСИ/СпособыВыбораИБДляОбменаНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыбораИБДляОбменаНСИ</name>
  <enumValues>
    <name>Все</name>
  </enumValues>
  <enumValues>
    <name>ВыбранногоТипа</name>
  </enumValues>
  <enumValues>
    <name>Выбранные</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СоответствиеВнешнимИБ/СоответствиеВнешнимИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствиеВнешнимИБ</name>
  <basedOn>Catalog.ПеречисленияБД</basedOn>
  <basedOn>Catalog.СправочникиБД</basedOn>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаВИБ</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаКонсолидации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоВидыСубконто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОперандаИнтерфейс</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаСоответствияВИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживатьИерархиюВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияПоGUID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневойКаталог</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСоответствияРодитель</name>
    <type>
      <types>CatalogRef.СоответствиеВнешнимИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаТек</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраТек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеНеактуальны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоИерархииВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеРодительВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеРодительТек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискРодителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаАналитикиТек</name>
    <comment>Результат функции Метаданные.ПолноеИмя()</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаАналитикиВИБ</name>
    <comment>Результат функции Метаданные.ПолноеИмя()</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПередЗаписьюВИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриЭкспорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеРеквизитов</name>
    <attributes>
      <name>РеквизитОбъектаКонсолидации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитОбъектаВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьДляСинхронизации</name>
      <comment>Ключевой = НЕ НеИспользоватьДляСинхронизации и Сопоставлено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеВИБ</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримитивныйТип</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитикиВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполнения</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПолейИсточника</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация1</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеЗначенийПеречислений</name>
    <attributes>
      <name>ЗначениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияСвязанныхОбъектов</name>
    <attributes>
      <name>ТипОбъектаВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаВИБ</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъектаТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаТек</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПараметрыОбменаНСИ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 

Функция ПолучитьПараметрыЗагрузкиНСИ(ПараметрыОбмена) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
	|	СоответствиеВнешнимИБ.Владелец КАК ТипБД
	|ПОМЕСТИТЬ НастройкиСоответствия
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаТек = &ОписаниеОбъектаТек
	|	И НЕ СоответствиеВнешнимИБ.ПометкаУдаления
	|	И НЕ СоответствиеВнешнимИБ.СинхронизацияПоGUID";
	
	Запрос.УстановитьПараметр("ОписаниеОбъектаТек",ПараметрыОбмена.ОписаниеОбъектаМетаданных);
	
	Если ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.Все Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,Неопределено КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы";
		
	ИначеЕсли ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.ВыбранногоТипа Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ТипБД,АдресацияОбменаНСИ.Отбор
		|Поместить ТипыБД
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД, ТипыБД.Отбор КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ТипыБД КАК ТипыБД
		|ПО ВнешниеИнформационныеБазы.ТипБД=ТипыБД.ТипБД";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	Иначе
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ИспользуемаяИБ,АдресацияОбменаНСИ.Отбор КАК Отбор
		|Поместить ВИБ
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|; 
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,ВИБ.Отбор КАК Отбор 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ВИБ КАК ВИБ
		|ПО ВнешниеИнформационныеБазы.Ссылка=ВИБ.ИспользуемаяИБ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|;
	|ВЫБРАТЬ НастройкиСоответствия.НастройкаСоответствия,
	|ВнешниеИнформационныеБазы.ИспользуемаяИБ КАК ИспользуемаяИБ,
	|ВнешниеИнформационныеБазы.Отбор КАК НастройкаОтбора
	|ИЗ НастройкиСоответствия КАК НастройкиСоответствия
	|Внутреннее Соединение ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|ПО НастройкиСоответствия.ТипБД=ВнешниеИнформационныеБазы.ТипБД";

	Возврат Запрос.Выполнить().Выгрузить();
					
КонецФункции // ПолучитьТаблицуПараметровДляОбмена()

Функция ПолучитьПараметрыВыгрузкиНСИ(ПараметрыОбмена) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.Ссылка КАК НастройкаСоответствия,
	|	СоответствиеВнешнимИБ.Владелец КАК ТипБД
	|ПОМЕСТИТЬ НастройкиСоответствия
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаТек = &ОписаниеОбъектаТек
	|	И НЕ СоответствиеВнешнимИБ.ПометкаУдаления
	|	И НЕ СоответствиеВнешнимИБ.СинхронизацияПоGUID";
	
	Запрос.УстановитьПараметр("ОписаниеОбъектаТек",ПараметрыОбмена.ОписаниеОбъектаМетаданных);
	
	Если ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.Все Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|ГДЕ ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
	ИначеЕсли ПараметрыОбмена.СпособВыбораИБ=Перечисления.СпособыВыбораИБДляОбменаНСИ.ВыбранногоТипа Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ТипБД
		|Поместить ТипыБД
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|;
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ТипыБД КАК ТипыБД
		|ПО ВнешниеИнформационныеБазы.ТипБД=ТипыБД.ТипБД
		|И ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	Иначе
		
		Запрос.Текст=Запрос.Текст+"
		|; 
		|ВЫБРАТЬ АдресацияОбменаНСИ.АдресОбмена КАК ИспользуемаяИБ
		|Поместить ВИБ
		|ИЗ &АдресацияОбменаНСИ КАК АдресацияОбменаНСИ
		|; 
		|ВЫБРАТЬ ВнешниеИнформационныеБазы.Ссылка КАК ИспользуемаяИБ,ВнешниеИнформационныеБазы.ТипБД КАК ТипБД 
		|Поместить ВнешниеИнформационныеБазы
		|ИЗ Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
		|Внутреннее Соединение ВИБ КАК ВИБ
		|ПО ВнешниеИнформационныеБазы.Ссылка=ВИБ.ИспользуемаяИБ
		|И ВнешниеИнформационныеБазы.ЭкспортироватьЭлементыНСИ";
		
		Запрос.УстановитьПараметр("АдресацияОбменаНСИ",ПараметрыОбмена.АдресацияОбменаНСИ);
		
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|;
	|ВЫБРАТЬ НастройкиСоответствия.НастройкаСоответствия,
	|ВнешниеИнформационныеБазы.ИспользуемаяИБ КАК ИспользуемаяИБ
	|ИЗ НастройкиСоответствия КАК НастройкиСоответствия
	|Внутреннее Соединение ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|ПО НастройкиСоответствия.ТипБД=ВнешниеИнформационныеБазы.ТипБД";
	
	Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции // ПолучитьТаблицуПараметровДляОбмена()

#КонецЕсли
